In [1]:
import pandas as pd

#Load the web_events.csv data set into a Pandas dataframe.

In [2]:
events = pd.read_csv('https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/web_events.csv')

events.info

events.head()

       timestamp  visitorid event  itemid  transactionid
0  1433221332117     257597  view  355908            NaN
1  1433224214164     992329  view  248676            NaN
2  1433221999827     111016  view  318965            NaN
3  1433221955914     483717  view  253185            NaN
4  1433221337106     951259  view  367447            NaN

# Convert the values in the timestamp field to datetimes.

In [19]:
events['timestamp'] = pd.to_datetime(events['timestamp'], unit='ms')
events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2756101 entries, 0 to 2756100
Data columns (total 5 columns):
 #   Column         Dtype
---  ------         -----
 0   timestamp      datetime64[ns]
 1   visitorid      int64
 2   event          object
 3   itemid         int64
 4   transactionid  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 105.1+ MB

Extract different time units from the timestamp field. Aggregate on each one, counting the number of records, and see what insights you can discover for each type of event.

In [31]:
events['day'] = events['timestamp'].dt.day
events['month'] = events['timestamp'].dt.month
events['year'] = events['timestamp'].dt.year

In [32]:
day_of_month = events.groupby('day').count()

day_of_month['timestamp'].sort_values(ascending=False)

day
14    103072
7     102839
15    102451
10    100289
8      99072
13     98174
4      98103
11     97610
6      97340
3      97334
9      96252
17     95948
12     94946
5      94349
26     93553
16     91599
25     90921
18     89176
27     85541
19     84312
20     82351
22     80932
28     80799
29     80723
24     80703
21     78672
2      77508
1      77197
23     75639
30     74730
31     53966
Name: timestamp, dtype: int64

We have more records for the middle of the month than any other time period. We see that the 14th and 15th have the most and 3rd most records respectively. 

We have the fewest records for the last two days of the month (30 and 31). It isn't suprising that we have fewer records for the 31st since not all months have 31 days.

In [33]:
month = events.groupby('month').count()

month['timestamp'].sort_values(ascending=False)

month
7    697984
6    610393
5    590652
8    553362
9    303710
Name: timestamp, dtype: int64

We only have records from May to September. July has the most records of any month, with September containing the fewest records.

In [34]:
year = events.groupby('year').count()

year['timestamp'].sort_values(ascending=False)

year
2015    2756101
Name: timestamp, dtype: int64

We only have data from the year 2015.

# Round datetimes by hour, aggregate, and see what insights you can discover.

In [39]:
events['hour'] = events['timestamp'].dt.round('H')
events['hour'] = events['hour'].dt.hour

hour = events.groupby('hour').count()

hour['timestamp'].sort_values(ascending=False)

hour
21    186821
20    186163
18    182608
19    181444
22    180913
17    172255
23    168257
4     151716
0     151210
3     148576
16    147325
2     142286
1     141481
5     135492
15    104702
6      99396
14     63954
7      58369
13     40588
8      33111
12     24735
9      20755
11     17686
10     16258
Name: timestamp, dtype: int64

Most of our web events occur between 5-11 PM and our fewest events occur between 6AM-2PM. So most of our events occur in the evening hours when people are home from work. Not suprisingly the fewest events happen when people are either at work or asleep.

#Load the life_expectancy.csv data set into a Pandas dataframe.

In [3]:
life_df = pd.read_csv('https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/life_expectancy.csv')

life_df.head()

life_df.head()

  Country Name Country Code  ...    2015    2016
0        Aruba          ABW  ...  75.725  75.867
1  Afghanistan          AFG  ...  63.288  63.673
2       Angola          AGO  ...  61.241  61.547
3      Albania          ALB  ...  78.174  78.345
4      Andorra          AND  ...     NaN     NaN

[5 rows x 61 columns]

# Transform/melt the data so that the years are listed in a single column instead of separate columns.

In [40]:
ids = ['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code']
melted_fields = list(life_df.columns.drop(ids))

In [41]:
melted = pd.melt(life_df, id_vars=ids, value_vars=melted_fields, var_name='Year', value_name='Value')

melted.head()

  Country Name Country Code  ...  Year   Value
0        Aruba          ABW  ...  1960  65.662
1  Afghanistan          AFG  ...  1960  32.292
2       Angola          AGO  ...  1960  33.251
3      Albania          ALB  ...  1960  62.279
4      Andorra          AND  ...  1960     NaN

[5 rows x 6 columns]

# Practice address missing values for countries using the different approaches (imputation, interpolation, and deletion).

In [42]:
melted.isnull().sum()

Country Name         0
Country Code         0
Indicator Name       0
Indicator Code       0
Year                 0
Value             1301
dtype: int64

In [44]:
#imputation with median value
impute = melted.copy()
impute['Value'] = impute['Value'].fillna(impute['Value'].mean())
impute

       Country Name Country Code  ...  Year      Value
0             Aruba          ABW  ...  1960  65.662000
1       Afghanistan          AFG  ...  1960  32.292000
2            Angola          AGO  ...  1960  33.251000
3           Albania          ALB  ...  1960  62.279000
4           Andorra          AND  ...  1960  63.544406
...             ...          ...  ...   ...        ...
15043        Kosovo          XKX  ...  2016  71.646341
15044   Yemen, Rep.          YEM  ...  2016  64.953000
15045  South Africa          ZAF  ...  2016  62.774000
15046        Zambia          ZMB  ...  2016  61.874000
15047      Zimbabwe          ZWE  ...  2016  61.163000

[15048 rows x 6 columns]

In [46]:
#interpolation with forward fill
ff = melted.copy()
ff['Value'] = ff['Value'].fillna(method='ffill')
ff

       Country Name Country Code  ...  Year      Value
0             Aruba          ABW  ...  1960  65.662000
1       Afghanistan          AFG  ...  1960  32.292000
2            Angola          AGO  ...  1960  33.251000
3           Albania          ALB  ...  1960  62.279000
4           Andorra          AND  ...  1960  62.279000
...             ...          ...  ...   ...        ...
15043        Kosovo          XKX  ...  2016  71.646341
15044   Yemen, Rep.          YEM  ...  2016  64.953000
15045  South Africa          ZAF  ...  2016  62.774000
15046        Zambia          ZMB  ...  2016  61.874000
15047      Zimbabwe          ZWE  ...  2016  61.163000

[15048 rows x 6 columns]

In [52]:
#deletion
delete = melted.copy()
delete = delete.dropna()
delete

       Country Name Country Code  ...  Year      Value
0             Aruba          ABW  ...  1960  65.662000
1       Afghanistan          AFG  ...  1960  32.292000
2            Angola          AGO  ...  1960  33.251000
3           Albania          ALB  ...  1960  62.279000
5        Arab World          ARB  ...  1960  46.825065
...             ...          ...  ...   ...        ...
15043        Kosovo          XKX  ...  2016  71.646341
15044   Yemen, Rep.          YEM  ...  2016  64.953000
15045  South Africa          ZAF  ...  2016  62.774000
15046        Zambia          ZMB  ...  2016  61.874000
15047      Zimbabwe          ZWE  ...  2016  61.163000

[13747 rows x 6 columns]